Revit 2027 API
ParameterTypeId.HandrailSupportsTypeParam Property
 "Family"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId HandrailSupportsTypeParam { get; }
Public Shared ReadOnly Property HandrailSupportsTypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ HandrailSupportsTypeParam {
	ForgeTypeId^ get ();
}
static member HandrailSupportsTypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace